{"pageProps":{"projectName":"ACE-SecureCode","currentAdr":{"slug":"20220603-address-security-and-compliance-risk-in-the-sdlc","package":null,"title":"Address Security and Compliance Risk in the SDLC","status":"draft","supersededBy":null,"tags":["process"],"deciders":["CISO","Architects","Dev Managers"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nManage the security life cycle of in-house developed, hosted, or acquired software to prevent, detect, and remediate security weaknesses before they can impact the enterprise.\n\n## Decision Drivers\n\n- Establish and Maintain a Secure Application Development Process\n- Establish and Maintain a Process to Accept and Address Software Vulnerabilities\n- Perform Root Cause Analysis on Security Vulnerabilities\n- Establish and Manage an Inventory of Third-Party Software Components\n- Use Up-to-Date and Trusted Third-Party Software Components\n- Establish and Maintain a Severity Rating System and Process for Application Vulnerabilities\n- Train Developers in Application Security Concepts and Secure Coding\n- Apply Secure Design Principles in Application Architectures\n- Implement Code-Level Security Checks\n\n## Considered Options\n\nBuilding the foundation of a secure and compliant SDLC would require the following,\n\n- Track application dependencies\n- Engage in manual code review\n- Create repeatable, documented processes\n- Use an automated code analysis solution\n\n## Pros and Cons of the Options\n\n### Track application dependencies\n\nWhen tracking dependencies, some best practices include:\n\n- Focusing on individual features or use-cases\n- Using a dependency manager\n- Talking with all internal stakeholders involved in the application’s development, like architects, IT leadership, and developers\n\n\n### Code reviews\n\nReviewing source code is fundamental to finding an application’s security weaknesses.\nWhen performing a security code review, some best practices include:\n\n- Looking for vulnerabilities that target the application type\n- Reviewing for vulnerability indicators and signatures\n- Tracking data flows to identify common vulnerabilities\n- Searching for strings, keywords, and code patterns known to be indicators for vulnerabilities and misconfigurations\n- Search plain-text data sets for dangerous functions\n- Review potentially risky functions for reachability\n- Review user input locations for exploitable vulnerabilities that can act as entry points\n\n\n### Documenting processes\n\nPart of compliance is being able to prove that you can maintain your security posture.\nSome ways to embed application security into your application development processes include:\n\n- Building security into the pull request process\n- Setting practices for using security tools to validate manual reviews\n- Incorporating security checks as a release gate for deployment and software delivery\n- Implementing a software delivery model that includes security, functional, and performance sign-offs as a deployment condition\n\n\n### Automated code analysis\n\nManaging all code reviews manually becomes time-consuming. Additionally, it increases the likelihood of human error risks.\nAutomated tools that can help streamline the code review process include:\n\n- Static Analysis Security Testing (SAST): identify vulnerable code patterns\n- Software Composition Analysis (SCA): scan code for CVEs found in an application’s dependencies\n\n## Links\n\n1. https://scribe.rip/re-introducing-application-security-to-your-team-baeb211f9192\n2. https://owasp.org/www-project-code-review-guide/assets/OWASP_Code_Review_Guide_v2.pdf\n"},"creationDate":"2022-06-03T17:01:14.000Z","lastEditDate":"2022-06-03T17:01:14.000Z","lastEditAuthor":"Deepansh Sood","publicationDate":null,"file":{"relativePath":"docs/adr/20220603-address-security-and-compliance-risk-in-the-sdlc.md","absolutePath":"/home/runner/work/ACE-CW-SecureCode/ACE-CW-SecureCode/docs/adr/20220603-address-security-and-compliance-risk-in-the-sdlc.md"},"repository":{"provider":"github","viewUrl":"https://github.com/rootbid/ACE-CW-SecureCode/blob/master/docs/adr/20220603-address-security-and-compliance-risk-in-the-sdlc.md"}},"l4bVersion":"1.0.0-beta.12"},"__N_SSG":true}